c5/src/Enums/FormStatuses/FormStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>FormStatuses</name>
  <enumValues>
    <name>Saved</name>
  </enumValues>
  <enumValues>
    <name>Waiting</name>
  </enumValues>
  <enumValues>
    <name>Unloaded</name>
  </enumValues>
  <enumValues>
    <name>Printed</name>
  </enumValues>
  <enumValues>
    <name>Submitted</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Returned</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/InvoiceRecord/InvoiceRecord.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>InvoiceRecord</name>
  <basedOn>Document.Invoice</basedOn>
  <basedOn>Document.Transfer</basedOn>
  <basedOn>Document.LVITransfer</basedOn>
  <basedOn>Document.VendorReturn</basedOn>
  <basedOn>Document.Sale</basedOn>
  <basedOn>Document.WriteOff</basedOn>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.RangeStatuses</registerRecords>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachedDocuments</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AttachmentRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Base</name>
    <type>
      <types>DefinedType.InvoiceRecordBase</types>
    </type>
  </attributes>
  <attributes>
    <name>Carrier</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomerAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>Delegated</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Description</name>
    <type>
      <types>DefinedType.SaleDescription</types>
    </type>
  </attributes>
  <attributes>
    <name>Dispatcher</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Driver</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>FirstPageRows</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FormNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>LoadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>LoadingPoint</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneyNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PowerAttorneySeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>PrintBack</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Range</name>
    <type>
      <types>CatalogRef.Ranges</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Redirects</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Series</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowServices</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.FormStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Storekeeper</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Transfer</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.Print</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingAddress</name>
    <type>
      <types>CatalogRef.Addresses</types>
    </type>
  </attributes>
  <attributes>
    <name>UnloadingPoint</name>
    <type>
      <types>CatalogRef.Organizations</types>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WaybillSeries</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Discounts</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Detail</name>
      <type>
        <types>DocumentRef.Payment</types>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Refund</types>
      </type>
    </attributes>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.Invoice</types>
        <types>DocumentRef.Bill</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.Refund</types>
        <types>DocumentRef.Debts</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ExtraCharge</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.FixedAssets</types>
        <types>CatalogRef.Items</types>
        <types>CatalogRef.IntangibleAssets</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>ProducerPrice</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Series</name>
      <type>
        <types>CatalogRef.Series</types>
      </type>
    </attributes>
    <attributes>
      <name>Social</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>OtherInfo</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/CommonModules/FormsPrint/Module.bsl
&AtClient
Procedure InvoiceRecord ( Objects ) export
	
	p = Print.GetParams ();
	p.Objects = Objects;
	p.Key = "InvoiceRecord";
	p.Template = "Invoice";
	Print.Print ( p );
	
EndProcedure

&AtServer
Function Check ( Reference, Status ) export
	
	if ( forGovernment ( Reference ) ) then
		Output.EFacturaForGovernment ( , "Customer", Reference );
		return false;
	else
		if ( Status = PredefinedValue ( "Enum.FormStatuses.Printed" )
			or Status = PredefinedValue ( "Enum.FormStatuses.Submitted" ) ) then
			return true;
		else
			Output.FormNotReady ( new Structure ( "Ref", Reference ), "Status", Reference );
			return false;
		endif;
	endif;
	
EndFunction

&AtServer
Function forGovernment ( Reference )
	
	s = "
	|select top 1 1
	|from Document.InvoiceRecord
	|where Ref = &Ref
	|and cast ( Customer as Catalog.Organizations ).Government
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Reference );
	return not q.Execute ().IsEmpty ();
	
EndFunction
